Tekla.Structures.ModelInternal.TeklaStructuresApplicationProxy
TS Service remote class proxy.

Tekla.Structures.ModelInternal.TeklaStructuresApplicationProxy._Instance
The remote TS Service object.

Tekla.Structures.ModelInternal.TeklaStructuresApplicationProxy.#cctor
Initializes static instance variable.

Tekla.Structures.ModelInternal.TeklaStructuresApplicationProxy.Instance
Gets the singleton TS Service instance.